OdCmTransparency.m_AM
\details
The combined value of the transparency method and transparency components.
\sa
Methods of the Transparency Definition

OdCmTransparency.dwgOut(OdDbDwgFiler*)
\details
Writes to the specified .dwg filer data of this object.
\param pFiler [in]  Pointer to the filer that the data is to be written to.

OdCmTransparency.dwgIn(OdDbDwgFiler*)
\details
Reads from the specified .dwg filer data for this object.
\param pFiler [in]  Pointer to the filer that the data is to be read from.

OdCmTransparency.serializeIn(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the transparency method and transparency components as an integer value
for the transparency object.
\param transparency [in]  A packed 32-bit integer value that specifies the
transparency method and transparency components.
\sa
Example of Working with TransparencyMethods of the Transparency DefinitionTransparency Functionality as an Integer-value

OdCmTransparency.serializeOut
\details
Returns the packed 32-bit integer value that stores the transparency method
and transparency components.
\sa
Example of Working with TransparencyMethods of the Transparency DefinitionTransparency Functionality as an Integer-value

OdCmTransparency.isSolid
\details
Checks whether the transparency method is byAlpha and the opacity is set to
full for this transparency object. It returns true if and only if the
transparency method is set to kByAlpha and Alpha = 255, otherwise it returns
false.
\sa
Example of Working with TransparencyMethods of the Transparency DefinitionTransparency Functionality as an Alpha-value

OdCmTransparency.isClear
\details
Checks whether the transparency method is byAlpha and the transparency is
set to full for this transparency object. It returns true if and only if the
transparency method is set to kByAlpha and Alpha = 0, otherwise it returns
false.
\sa
Example of Working with TransparencyMethods of the Transparency DefinitionTransparency Functionality as an Alpha-value

OdCmTransparency.isInvalid
\details
Checks whether the transparency method is an error value for the transparency
object and returns true if and only if the transparency method is set to
kErrorValue, otherwise it returns false.
\sa
Example of Working with TransparencyMethods of the Transparency Definition

OdCmTransparency.isByLayer
\details
Checks whether the transparency method is byLayer for the transparency
object and returns true if and only if the transparency method is set to
kByLayer, otherwise it returns false.
\sa
Example of Working with TransparencyMethods of the Transparency Definition

OdCmTransparency.isByBlock
\details
Checks whether the transparency method is byBlock for the transparency
object and returns true if and only if the transparency method is set to
kByBlock, otherwise it returns false.
\sa
Example of Working with TransparencyMethods of the Transparency Definition

OdCmTransparency.isByAlpha
\details
Checks whether the transparency method is byAlpha for the transparency
object and returns true if and only if the transparency method is set to
kByAlpha, otherwise it returns false.
\sa
Example of Working with TransparencyMethods of the Transparency Definition

OdCmTransparency.setMethod(OdCmTransparency.transparencyMethod)
\details
Sets the transparency method for the transparency object.
\param method [in]  Transparency method as the transparencyMethod enumeration.
\remarks
The transparency method can be one of the following:
NameValueDescription
kByLayer       0               Transparency is specified by the layer object that the object is assigned to.
kByBlock       1               Transparency is specified by the block object that the object is contained in.
kByAlpha       2               Transparency is specified by an alpha value.
\sa
Example of Working with TransparencyMethods of the Transparency Definition

OdCmTransparency.method
\details
Returns the transparency method of the transparency object as a value of the transparencyMethod enumeration.
\remarks
The transparency method can be a one of the following:
NameValueDescription
kByLayer       0               Transparency is specified by the layer object that the object is assigned to.
kByBlock       1               Transparency is specified by the block object that the object is contained in.
kByAlpha       2               Transparency is specified by an alpha value.
\sa
Example of Working with TransparencyMethods of the Transparency Definition

OdCmTransparency.alphaPercent
\details
Returns the alpha value in the range from 0.0 to 1.0 of the transparency object.
\remarks
An alpha value defines the degree of transparency.
Alpha = 0.0 corresponds to full transparency. Alpha = 1.0 corresponds to full opacity.
\sa
Example of Working with TransparencyTransparency Functionality as an Alpha-value

OdCmTransparency.setAlphaPercent(System.Double)
\details
Sets the alpha value as a percentage and switches the transparency method to
kByAlpha for the transparency object.
\param alphaPercent [in]  Alpha as a double value in the range from 0.0 to 1.0.
\remarks
An alpha value defines the degree of transparency.
Alpha = 0.0 corresponds to full transparency. Alpha = 1.0 corresponds to full opacity.
\sa
Example of Working with TransparencyTransparency Functionality as an Alpha-value

OdCmTransparency.alpha
\details
Returns the alpha value in the range from 0 to 255 of the transparency object.
\remarks
An alpha value defines the degree of transparency.
Alpha = 0 corresponds to full transparency. Alpha = 255 corresponds to full opacity.
\sa
Example of Working with TransparencyTransparency Functionality as an Alpha-value

OdCmTransparency.setAlpha(System.Byte)
\details
Sets the alpha value and switches the transparency method to kByAlpha for the transparency object.
\param alpha [in]  Alpha value as an integer value in the range 0 to 255.
\remarks
An alpha value defines the degree of transparency.
Alpha = 0 corresponds to full transparency. Alpha = 255 corresponds to full opacity.
\sa
Example of Working with TransparencyTransparency Functionality as an Alpha-value

OdCmTransparency.op_Inequality(OdCmTransparency!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compares two transparency objects as integer values, and returns true when
their values are not equal or false when their values are equal.
\sa
Example of Working with TransparencyTransparency Functionality as an Integer-value

OdCmTransparency.op_Equality(OdCmTransparency!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compares two transparency objects as integer values, and returns true when
their values are equal or false when their values are not equal.
\sa
Example of Working with TransparencyTransparency Functionality as an Integer-value

OdCmTransparency.#ctor(System.Double)
\details Creates a transparency object and sets its transparency property
using a specified alpha value as a percentage.
\param alphaPercent [in] An alpha value of transparency in percent as a
double value in the range from 0.0 to 1.0.
\remarks
The transparency method is set to kByAlpha.
Alpha = 0.0 corresponds to full transparency. Alpha = 1.0 corresponds to full opacity.
\sa
Transparency Functionality as an Alpha-value

OdCmTransparency.#ctor(System.Byte)
\details Creates a transparency object and sets its transparency property
using a specified alpha value.
\param alpha [in] An alpha value of transparency as an integer value in the
range from 0 to 255.
\remarks
The transparency method is set to kByAlpha.
Alpha = 0 corresponds to full transparency. Alpha = 255 corresponds to full opacity.
\sa
Transparency Functionality as an Alpha-value

OdCmTransparency.#ctor(OdCmTransparency.transparencyMethod)
\details Creates a transparency object and sets the specified transparency
method for it.
\param method [in] Transparency method.
\sa
Methods of the Transparency Definition

OdCmTransparency.#ctor
\details Creates a transparency object with default properties.
\remarks
The default transparency method is kByLayer.